#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
Warning: Version constraints inside provider configuration blocks are deprecated

  on providers.tf line 2, in provider "google":
   2:   version = "~> 3.61.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

(and 3 more similar warnings elsewhere)
Success! The configuration is valid, but there were some validation warnings
as shown above.


#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # google_compute_global_address.gke-ingress-ip[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_global_address" "gke-ingress-ip" {
      [32m+[0m [0m[1m[0maddress[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "dev-gke-ingress-ip"
      [32m+[0m [0m[1m[0mproject[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
    }

[1m  # google_compute_global_address.private_ip_alloc[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_global_address" "private_ip_alloc" {
      [32m+[0m [0m[1m[0maddress[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0maddress_type[0m[0m       = "INTERNAL"
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "private-ip-address-new"
      [32m+[0m [0m[1m[0mnetwork[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprefix_length[0m[0m      = 24
      [32m+[0m [0m[1m[0mproject[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mpurpose[0m[0m            = "VPC_PEERING"
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
    }

[1m  # google_container_node_pool.this["app-standard-small"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_container_node_pool" "this" {
      [32m+[0m [0m[1m[0mcluster[0m[0m             = "devops-dev-cluster"
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0minitial_node_count[0m[0m  = 0
      [32m+[0m [0m[1m[0minstance_group_urls[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "asia-southeast1"
      [32m+[0m [0m[1m[0mmax_pods_per_node[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                = "devops-dev-app-standard-small-pool"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mnode_count[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mnode_locations[0m[0m      = [
          [32m+[0m [0m"asia-southeast1-a",
          [32m+[0m [0m"asia-southeast1-b",
          [32m+[0m [0m"asia-southeast1-c",
        ]
      [32m+[0m [0m[1m[0moperation[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m             = "devops"
      [32m+[0m [0m[1m[0mversion[0m[0m             = (known after apply)

      [32m+[0m [0mautoscaling {
          [32m+[0m [0m[1m[0mmax_node_count[0m[0m = 3
          [32m+[0m [0m[1m[0mmin_node_count[0m[0m = 0
        }

      [32m+[0m [0mmanagement {
          [32m+[0m [0m[1m[0mauto_repair[0m[0m  = true
          [32m+[0m [0m[1m[0mauto_upgrade[0m[0m = true
        }

      [32m+[0m [0mnode_config {
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m      = 100
          [32m+[0m [0m[1m[0mdisk_type[0m[0m         = "pd-standard"
          [32m+[0m [0m[1m[0mguest_accelerator[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mimage_type[0m[0m        = "COS"
          [32m+[0m [0m[1m[0mlabels[0m[0m            = {
              [32m+[0m [0m"environment"  = "dev"
              [32m+[0m [0m"node-pool"    = "app-standard-small"
              [32m+[0m [0m"node-purpose" = "general"
              [32m+[0m [0m"preemptible"  = "false"
            }
          [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mmachine_type[0m[0m      = "e2-meduim"
          [32m+[0m [0m[1m[0mmetadata[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0moauth_scopes[0m[0m      = [
              [32m+[0m [0m"https://www.googleapis.com/auth/devstorage.read_only",
              [32m+[0m [0m"https://www.googleapis.com/auth/logging.write",
              [32m+[0m [0m"https://www.googleapis.com/auth/monitoring",
            ]
          [32m+[0m [0m[1m[0mpreemptible[0m[0m       = false
          [32m+[0m [0m[1m[0mservice_account[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mtaint[0m[0m             = (known after apply)

          [32m+[0m [0mshielded_instance_config {
              [32m+[0m [0m[1m[0menable_integrity_monitoring[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0menable_secure_boot[0m[0m          = (known after apply)
            }

          [32m+[0m [0mworkload_metadata_config {
              [32m+[0m [0m[1m[0mnode_metadata[0m[0m = "GKE_METADATA_SERVER"
            }
        }

      [32m+[0m [0mtimeouts {
          [32m+[0m [0m[1m[0mcreate[0m[0m = "30m"
          [32m+[0m [0m[1m[0mdelete[0m[0m = "30m"
          [32m+[0m [0m[1m[0mupdate[0m[0m = "30m"
        }

      [32m+[0m [0mupgrade_settings {
          [32m+[0m [0m[1m[0mmax_surge[0m[0m       = 1
          [32m+[0m [0m[1m[0mmax_unavailable[0m[0m = 0
        }
    }

[1m  # google_container_node_pool.this["db-standard"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_container_node_pool" "this" {
      [32m+[0m [0m[1m[0mcluster[0m[0m             = "devops-dev-cluster"
      [32m+[0m [0m[1m[0mid[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0minitial_node_count[0m[0m  = 1
      [32m+[0m [0m[1m[0minstance_group_urls[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m            = "asia-southeast1"
      [32m+[0m [0m[1m[0mmax_pods_per_node[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                = "devops-dev-db-standard-pool"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mnode_count[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mnode_locations[0m[0m      = [
          [32m+[0m [0m"asia-southeast1-c",
        ]
      [32m+[0m [0m[1m[0moperation[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m             = "devops"
      [32m+[0m [0m[1m[0mversion[0m[0m             = (known after apply)

      [32m+[0m [0mautoscaling {
          [32m+[0m [0m[1m[0mmax_node_count[0m[0m = 2
          [32m+[0m [0m[1m[0mmin_node_count[0m[0m = 1
        }

      [32m+[0m [0mmanagement {
          [32m+[0m [0m[1m[0mauto_repair[0m[0m  = true
          [32m+[0m [0m[1m[0mauto_upgrade[0m[0m = true
        }

      [32m+[0m [0mnode_config {
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m      = 100
          [32m+[0m [0m[1m[0mdisk_type[0m[0m         = "pd-standard"
          [32m+[0m [0m[1m[0mguest_accelerator[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mimage_type[0m[0m        = "COS"
          [32m+[0m [0m[1m[0mlabels[0m[0m            = {
              [32m+[0m [0m"environment"  = "dev"
              [32m+[0m [0m"node-pool"    = "db-standard"
              [32m+[0m [0m"node-purpose" = "database"
              [32m+[0m [0m"preemptible"  = "false"
            }
          [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mmachine_type[0m[0m      = "e2-meduim"
          [32m+[0m [0m[1m[0mmetadata[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0moauth_scopes[0m[0m      = [
              [32m+[0m [0m"https://www.googleapis.com/auth/devstorage.read_only",
              [32m+[0m [0m"https://www.googleapis.com/auth/logging.write",
              [32m+[0m [0m"https://www.googleapis.com/auth/monitoring",
            ]
          [32m+[0m [0m[1m[0mpreemptible[0m[0m       = false
          [32m+[0m [0m[1m[0mservice_account[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mtaint[0m[0m             = (known after apply)

          [32m+[0m [0mshielded_instance_config {
              [32m+[0m [0m[1m[0menable_integrity_monitoring[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0menable_secure_boot[0m[0m          = (known after apply)
            }

          [32m+[0m [0mworkload_metadata_config {
              [32m+[0m [0m[1m[0mnode_metadata[0m[0m = "GKE_METADATA_SERVER"
            }
        }

      [32m+[0m [0mtimeouts {
          [32m+[0m [0m[1m[0mcreate[0m[0m = "30m"
          [32m+[0m [0m[1m[0mdelete[0m[0m = "30m"
          [32m+[0m [0m[1m[0mupdate[0m[0m = "30m"
        }

      [32m+[0m [0mupgrade_settings {
          [32m+[0m [0m[1m[0mmax_surge[0m[0m       = 1
          [32m+[0m [0m[1m[0mmax_unavailable[0m[0m = 0
        }
    }

[1m  # google_dns_managed_zone.private-zone[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_dns_managed_zone" "private-zone" {
      [32m+[0m [0m[1m[0mdescription[0m[0m   = "Private DNS zone of qa"
      [32m+[0m [0m[1m[0mdns_name[0m[0m      = "devops-new.local."
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m          = "devops-new-zone"
      [32m+[0m [0m[1m[0mname_servers[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mvisibility[0m[0m    = "private"

      [32m+[0m [0mprivate_visibility_config {
          [32m+[0m [0mnetworks {
              [32m+[0m [0m[1m[0mnetwork_url[0m[0m = (known after apply)
            }
        }
    }

[1m  # google_project_service.project[0][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_project_service" "project" {
      [32m+[0m [0m[1m[0mdisable_dependent_services[0m[0m = true
      [32m+[0m [0m[1m[0mdisable_on_destroy[0m[0m         = true
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                    = "devops"
      [32m+[0m [0m[1m[0mservice[0m[0m                    = "cloudresourcemanager.googleapis.com"
    }

[1m  # google_project_service.project[1][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_project_service" "project" {
      [32m+[0m [0m[1m[0mdisable_dependent_services[0m[0m = true
      [32m+[0m [0m[1m[0mdisable_on_destroy[0m[0m         = true
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                    = "devops"
      [32m+[0m [0m[1m[0mservice[0m[0m                    = "container.googleapis.com"
    }

[1m  # google_project_service.project[2][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_project_service" "project" {
      [32m+[0m [0m[1m[0mdisable_dependent_services[0m[0m = true
      [32m+[0m [0m[1m[0mdisable_on_destroy[0m[0m         = true
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                    = "devops"
      [32m+[0m [0m[1m[0mservice[0m[0m                    = "dns.googleapis.com"
    }

[1m  # google_project_service.project[3][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_project_service" "project" {
      [32m+[0m [0m[1m[0mdisable_dependent_services[0m[0m = true
      [32m+[0m [0m[1m[0mdisable_on_destroy[0m[0m         = true
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                    = "devops"
      [32m+[0m [0m[1m[0mservice[0m[0m                    = "iam.googleapis.com"
    }

[1m  # google_project_service.project[4][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_project_service" "project" {
      [32m+[0m [0m[1m[0mdisable_dependent_services[0m[0m = true
      [32m+[0m [0m[1m[0mdisable_on_destroy[0m[0m         = true
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                    = "devops"
      [32m+[0m [0m[1m[0mservice[0m[0m                    = "servicenetworking.googleapis.com"
    }

[1m  # google_service_networking_connection.cloudsql-ip-range[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_service_networking_connection" "cloudsql-ip-range" {
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mnetwork[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mpeering[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mreserved_peering_ranges[0m[0m = [
          [32m+[0m [0m"private-ip-address-new",
        ]
      [32m+[0m [0m[1m[0mservice[0m[0m                 = "servicenetworking.googleapis.com"
    }

[1m  # module.gke.google_container_cluster.cluster[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_container_cluster" "cluster" {
      [32m+[0m [0m[1m[0mcluster_ipv4_cidr[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdatapath_provider[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mdefault_max_pods_per_node[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0menable_binary_authorization[0m[0m = false
      [32m+[0m [0m[1m[0menable_intranode_visibility[0m[0m = false
      [32m+[0m [0m[1m[0menable_kubernetes_alpha[0m[0m     = false
      [32m+[0m [0m[1m[0menable_legacy_abac[0m[0m          = false
      [32m+[0m [0m[1m[0menable_shielded_nodes[0m[0m       = true
      [32m+[0m [0m[1m[0menable_tpu[0m[0m                  = false
      [32m+[0m [0m[1m[0mendpoint[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                          = (known after apply)
      [32m+[0m [0m[1m[0minitial_node_count[0m[0m          = 1
      [32m+[0m [0m[1m[0minstance_group_urls[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mlabel_fingerprint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                    = "asia-southeast1"
      [32m+[0m [0m[1m[0mlogging_service[0m[0m             = "logging.googleapis.com/kubernetes"
      [32m+[0m [0m[1m[0mmaster_version[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mmonitoring_service[0m[0m          = "monitoring.googleapis.com/kubernetes"
      [32m+[0m [0m[1m[0mname[0m[0m                        = "devops-dev-cluster"
      [32m+[0m [0m[1m[0mnetwork[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mnetworking_mode[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mnode_locations[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mnode_version[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0moperation[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                     = "devops"
      [32m+[0m [0m[1m[0mremove_default_node_pool[0m[0m    = true
      [32m+[0m [0m[1m[0mself_link[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mservices_ipv4_cidr[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msubnetwork[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mtpu_ipv4_cidr_block[0m[0m         = (known after apply)

      [32m+[0m [0maddons_config {
          [32m+[0m [0mcloudrun_config {
              [32m+[0m [0m[1m[0mdisabled[0m[0m           = (known after apply)
              [32m+[0m [0m[1m[0mload_balancer_type[0m[0m = (known after apply)
            }

          [32m+[0m [0mconfig_connector_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mdns_cache_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mgce_persistent_disk_csi_driver_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mhorizontal_pod_autoscaling {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = false
            }

          [32m+[0m [0mhttp_load_balancing {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = false
            }

          [32m+[0m [0mistio_config {
              [32m+[0m [0m[1m[0mauth[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mkalm_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }

          [32m+[0m [0mnetwork_policy_config {
              [32m+[0m [0m[1m[0mdisabled[0m[0m = false
            }
        }

      [32m+[0m [0mauthenticator_groups_config {
          [32m+[0m [0m[1m[0msecurity_group[0m[0m = (known after apply)
        }

      [32m+[0m [0mcluster_autoscaling {
          [32m+[0m [0m[1m[0mautoscaling_profile[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0menabled[0m[0m             = (known after apply)

          [32m+[0m [0mauto_provisioning_defaults {
              [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m     = (known after apply)
              [32m+[0m [0m[1m[0mservice_account[0m[0m  = (known after apply)
            }

          [32m+[0m [0mresource_limits {
              [32m+[0m [0m[1m[0mmaximum[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mminimum[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mresource_type[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mcluster_telemetry {
          [32m+[0m [0m[1m[0mtype[0m[0m = (known after apply)
        }

      [32m+[0m [0mconfidential_nodes {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mdatabase_encryption {
          [32m+[0m [0m[1m[0mkey_name[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mstate[0m[0m    = (known after apply)
        }

      [32m+[0m [0mdefault_snat_status {
          [32m+[0m [0m[1m[0mdisabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mip_allocation_policy {
          [32m+[0m [0m[1m[0mcluster_ipv4_cidr_block[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mcluster_secondary_range_name[0m[0m  = "devops-dev-vpc-pod-range"
          [32m+[0m [0m[1m[0mservices_ipv4_cidr_block[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mservices_secondary_range_name[0m[0m = "devops-dev-vpc-svc-range"
        }

      [32m+[0m [0mmaintenance_policy {
          [32m+[0m [0mdaily_maintenance_window {
              [32m+[0m [0m[1m[0mduration[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mstart_time[0m[0m = "17:00"
            }
        }

      [32m+[0m [0mmaster_auth {
          [32m+[0m [0m[1m[0mclient_certificate[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mclient_key[0m[0m             = (sensitive value)
          [32m+[0m [0m[1m[0mcluster_ca_certificate[0m[0m = (known after apply)

          [32m+[0m [0mclient_certificate_config {
              [32m+[0m [0m[1m[0missue_client_certificate[0m[0m = false
            }
        }

      [32m+[0m [0mmaster_authorized_networks_config {
          [32m+[0m [0mcidr_blocks {
              [32m+[0m [0m[1m[0mcidr_block[0m[0m   = "0.0.0.0/0"
              [32m+[0m [0m[1m[0mdisplay_name[0m[0m = "all-for-testing"
            }
        }

      [32m+[0m [0mnetwork_policy {
          [32m+[0m [0m[1m[0menabled[0m[0m  = true
          [32m+[0m [0m[1m[0mprovider[0m[0m = "CALICO"
        }

      [32m+[0m [0mnode_config {
          [32m+[0m [0m[1m[0mboot_disk_kms_key[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mdisk_type[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mguest_accelerator[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mimage_type[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mlabels[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mmachine_type[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mmetadata[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0moauth_scopes[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mpreemptible[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mservice_account[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mtaint[0m[0m             = (known after apply)

          [32m+[0m [0mephemeral_storage_config {
              [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m = (known after apply)
            }

          [32m+[0m [0mkubelet_config {
              [32m+[0m [0m[1m[0mcpu_cfs_quota[0m[0m        = (known after apply)
              [32m+[0m [0m[1m[0mcpu_cfs_quota_period[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mcpu_manager_policy[0m[0m   = (known after apply)
            }

          [32m+[0m [0mlinux_node_config {
              [32m+[0m [0m[1m[0msysctls[0m[0m = (known after apply)
            }

          [32m+[0m [0msandbox_config {
              [32m+[0m [0m[1m[0msandbox_type[0m[0m = (known after apply)
            }

          [32m+[0m [0mshielded_instance_config {
              [32m+[0m [0m[1m[0menable_integrity_monitoring[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0menable_secure_boot[0m[0m          = (known after apply)
            }

          [32m+[0m [0mworkload_metadata_config {
              [32m+[0m [0m[1m[0mnode_metadata[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mnode_pool {
          [32m+[0m [0m[1m[0minitial_node_count[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0minstance_group_urls[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmax_pods_per_node[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mname[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mname_prefix[0m[0m         = (known after apply)
          [32m+[0m [0m[1m[0mnode_count[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mnode_locations[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mversion[0m[0m             = (known after apply)

          [32m+[0m [0mautoscaling {
              [32m+[0m [0m[1m[0mmax_node_count[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mmin_node_count[0m[0m = (known after apply)
            }

          [32m+[0m [0mmanagement {
              [32m+[0m [0m[1m[0mauto_repair[0m[0m  = (known after apply)
              [32m+[0m [0m[1m[0mauto_upgrade[0m[0m = (known after apply)
            }

          [32m+[0m [0mnode_config {
              [32m+[0m [0m[1m[0mboot_disk_kms_key[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mdisk_size_gb[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0mdisk_type[0m[0m         = (known after apply)
              [32m+[0m [0m[1m[0mguest_accelerator[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mimage_type[0m[0m        = (known after apply)
              [32m+[0m [0m[1m[0mlabels[0m[0m            = (known after apply)
              [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mmachine_type[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0mmetadata[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mmin_cpu_platform[0m[0m  = (known after apply)
              [32m+[0m [0m[1m[0moauth_scopes[0m[0m      = (known after apply)
              [32m+[0m [0m[1m[0mpreemptible[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mservice_account[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mtags[0m[0m              = (known after apply)
              [32m+[0m [0m[1m[0mtaint[0m[0m             = (known after apply)

              [32m+[0m [0mephemeral_storage_config {
                  [32m+[0m [0m[1m[0mlocal_ssd_count[0m[0m = (known after apply)
                }

              [32m+[0m [0mkubelet_config {
                  [32m+[0m [0m[1m[0mcpu_cfs_quota[0m[0m        = (known after apply)
                  [32m+[0m [0m[1m[0mcpu_cfs_quota_period[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0mcpu_manager_policy[0m[0m   = (known after apply)
                }

              [32m+[0m [0mlinux_node_config {
                  [32m+[0m [0m[1m[0msysctls[0m[0m = (known after apply)
                }

              [32m+[0m [0msandbox_config {
                  [32m+[0m [0m[1m[0msandbox_type[0m[0m = (known after apply)
                }

              [32m+[0m [0mshielded_instance_config {
                  [32m+[0m [0m[1m[0menable_integrity_monitoring[0m[0m = (known after apply)
                  [32m+[0m [0m[1m[0menable_secure_boot[0m[0m          = (known after apply)
                }

              [32m+[0m [0mworkload_metadata_config {
                  [32m+[0m [0m[1m[0mnode_metadata[0m[0m = (known after apply)
                }
            }

          [32m+[0m [0mupgrade_settings {
              [32m+[0m [0m[1m[0mmax_surge[0m[0m       = (known after apply)
              [32m+[0m [0m[1m[0mmax_unavailable[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mnotification_config {
          [32m+[0m [0mpubsub {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mtopic[0m[0m   = (known after apply)
            }
        }

      [32m+[0m [0mpod_security_policy_config {
          [32m+[0m [0m[1m[0menabled[0m[0m = false
        }

      [32m+[0m [0mprivate_cluster_config {
          [32m+[0m [0m[1m[0menable_private_nodes[0m[0m   = true
          [32m+[0m [0m[1m[0mmaster_ipv4_cidr_block[0m[0m = "172.16.0.0/28"
          [32m+[0m [0m[1m[0mpeering_name[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mprivate_endpoint[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mpublic_endpoint[0m[0m        = (known after apply)

          [32m+[0m [0mmaster_global_access_config {
              [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0mrelease_channel {
          [32m+[0m [0m[1m[0mchannel[0m[0m = (known after apply)
        }

      [32m+[0m [0mworkload_identity_config {
          [32m+[0m [0m[1m[0midentity_namespace[0m[0m = "devops.svc.id.goog"
        }
    }

[1m  # module.gke-sa.google_project_iam_member.project-roles["devops-dev-gke-gsa-devops=>roles/logging.logWriter"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_project_iam_member" "project-roles" {
      [32m+[0m [0m[1m[0metag[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmember[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m = "devops"
      [32m+[0m [0m[1m[0mrole[0m[0m    = "roles/logging.logWriter"
    }

[1m  # module.gke-sa.google_project_iam_member.project-roles["devops-dev-gke-gsa-devops=>roles/monitoring.metricWriter"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_project_iam_member" "project-roles" {
      [32m+[0m [0m[1m[0metag[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmember[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m = "devops"
      [32m+[0m [0m[1m[0mrole[0m[0m    = "roles/monitoring.metricWriter"
    }

[1m  # module.gke-sa.google_project_iam_member.project-roles["devops-dev-gke-gsa-devops=>roles/storage.objectAdmin"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_project_iam_member" "project-roles" {
      [32m+[0m [0m[1m[0metag[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mmember[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m = "devops"
      [32m+[0m [0m[1m[0mrole[0m[0m    = "roles/storage.objectAdmin"
    }

[1m  # module.gke-sa.google_service_account.service_accounts["devops-dev-gke-gsa"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_service_account" "service_accounts" {
      [32m+[0m [0m[1m[0maccount_id[0m[0m   = "devops-dev-gke-gsa"
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m = "Terraform-managed service account"
      [32m+[0m [0m[1m[0memail[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m      = "devops"
      [32m+[0m [0m[1m[0munique_id[0m[0m    = (known after apply)
    }

[1m  # module.vpc.google_compute_network.vpc[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_network" "vpc" {
      [32m+[0m [0m[1m[0mauto_create_subnetworks[0m[0m         = false
      [32m+[0m [0m[1m[0mdelete_default_routes_on_create[0m[0m = false
      [32m+[0m [0m[1m[0mgateway_ipv4[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mmtu[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                            = "devops-dev-vpc-network"
      [32m+[0m [0m[1m[0mproject[0m[0m                         = "devops"
      [32m+[0m [0m[1m[0mrouting_mode[0m[0m                    = "REGIONAL"
      [32m+[0m [0m[1m[0mself_link[0m[0m                       = (known after apply)
    }

[1m  # module.vpc.google_compute_router.vpc_router[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_router" "vpc_router" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "devops-dev-vpc-router"
      [32m+[0m [0m[1m[0mnetwork[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m            = "devops"
      [32m+[0m [0m[1m[0mregion[0m[0m             = "asia-southeast1"
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
    }

[1m  # module.vpc.google_compute_router_nat.vpc_nat[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_router_nat" "vpc_nat" {
      [32m+[0m [0m[1m[0menable_endpoint_independent_mapping[0m[0m = true
      [32m+[0m [0m[1m[0micmp_idle_timeout_sec[0m[0m               = 30
      [32m+[0m [0m[1m[0mid[0m[0m                                  = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                = "devops-dev-vpc-nat"
      [32m+[0m [0m[1m[0mnat_ip_allocate_option[0m[0m              = "AUTO_ONLY"
      [32m+[0m [0m[1m[0mproject[0m[0m                             = "devops"
      [32m+[0m [0m[1m[0mregion[0m[0m                              = "asia-southeast1"
      [32m+[0m [0m[1m[0mrouter[0m[0m                              = "devops-dev-vpc-router"
      [32m+[0m [0m[1m[0msource_subnetwork_ip_ranges_to_nat[0m[0m  = "LIST_OF_SUBNETWORKS"
      [32m+[0m [0m[1m[0mtcp_established_idle_timeout_sec[0m[0m    = 1200
      [32m+[0m [0m[1m[0mtcp_transitory_idle_timeout_sec[0m[0m     = 30
      [32m+[0m [0m[1m[0mudp_idle_timeout_sec[0m[0m                = 30

      [32m+[0m [0msubnetwork {
          [32m+[0m [0m[1m[0mname[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0msecondary_ip_range_names[0m[0m = []
          [32m+[0m [0m[1m[0msource_ip_ranges_to_nat[0m[0m  = [
              [32m+[0m [0m"ALL_IP_RANGES",
            ]
        }
    }

[1m  # module.vpc.google_compute_subnetwork.vpc_subnetwork_public[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_subnetwork" "vpc_subnetwork_public" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mfingerprint[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mgateway_address[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0mip_cidr_range[0m[0m              = "10.0.10.0/24"
      [32m+[0m [0m[1m[0mname[0m[0m                       = "devops-dev-vpc-subnetwork"
      [32m+[0m [0m[1m[0mnetwork[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mprivate_ip_google_access[0m[0m   = true
      [32m+[0m [0m[1m[0mprivate_ipv6_google_access[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mproject[0m[0m                    = "devops"
      [32m+[0m [0m[1m[0mregion[0m[0m                     = "asia-southeast1"
      [32m+[0m [0m[1m[0msecondary_ip_range[0m[0m         = [
          [32m+[0m [0m{
              [32m+[0m [0mip_cidr_range = "172.16.10.0/24"
              [32m+[0m [0mrange_name    = "devops-dev-vpc-svc-range"
            },
          [32m+[0m [0m{
              [32m+[0m [0mip_cidr_range = "10.255.0.0/16"
              [32m+[0m [0mrange_name    = "devops-dev-vpc-pod-range"
            },
        ]
      [32m+[0m [0m[1m[0mself_link[0m[0m                  = (known after apply)

      [32m+[0m [0mlog_config {
          [32m+[0m [0m[1m[0maggregation_interval[0m[0m = "INTERVAL_10_MIN"
          [32m+[0m [0m[1m[0mfilter_expr[0m[0m          = "true"
          [32m+[0m [0m[1m[0mflow_sampling[0m[0m        = 0.5
          [32m+[0m [0m[1m[0mmetadata[0m[0m             = "INCLUDE_ALL_METADATA"
        }
    }

[0m[1mPlan:[0m 20 to add, 0 to change, 0 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [32m+[0m [0m[1m[0mcluster_endpoint[0m[0m = (sensitive value)
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named "cloudsql_servers" but a
[33m│[0m [0mvalue was found in file "terraform.tfvars". If you meant to use this value,
[33m│[0m [0madd a "variable" block to the configuration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mVersion constraints inside provider configuration blocks are deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  on providers.tf line 2, in provider "google":
[33m│[0m [0m   2:   version = [4m"~> 3.61.0"[0m[0m
[33m│[0m [0m
[33m│[0m [0mTerraform 0.13 and earlier allowed provider version constraints inside the
[33m│[0m [0mprovider configuration block, but that is now deprecated and will be
[33m│[0m [0mremoved in a future version of Terraform. To silence this warning, move the
[33m│[0m [0mprovider version constraint into the required_providers block.
[33m│[0m [0m
[33m│[0m [0m(and 3 more similar warnings elsewhere)
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
*Pusher: @safe2008, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform_Plan`*